{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v3.14.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_18", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4096], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_18"}, "inbound_nodes": []}, {"name": "reshape_23", "class_name": "Reshape", "config": {"name": "reshape_23", "trainable": true, "dtype": "float32", "target_shape": [64, 64, 1]}, "inbound_nodes": [[["input_18", 0, 0, {}]]]}, {"name": "conv2d_242", "class_name": "Conv2D", "config": {"name": "conv2d_242", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999969612645e-09}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_23", 0, 0, {}]]]}, {"name": "average_pooling2d_98", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_98", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["reshape_23", 0, 0, {}]]]}, {"name": "activation_90", "class_name": "Activation", "config": {"name": "activation_90", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["conv2d_242", 0, 0, {}]]]}, {"name": "conv2d_241", "class_name": "Conv2D", "config": {"name": "conv2d_241", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_98", 0, 0, {}]]]}, {"name": "add_134", "class_name": "Add", "config": {"name": "add_134", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_90", 0, 0, {}], ["conv2d_241", 0, 0, {}]]]}, {"name": "conv2d_244", "class_name": "Conv2D", "config": {"name": "conv2d_244", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999969612645e-09}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_134", 0, 0, {}]]]}, {"name": "average_pooling2d_99", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_99", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_134", 0, 0, {}]]]}, {"name": "activation_91", "class_name": "Activation", "config": {"name": "activation_91", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["conv2d_244", 0, 0, {}]]]}, {"name": "conv2d_243", "class_name": "Conv2D", "config": {"name": "conv2d_243", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_99", 0, 0, {}]]]}, {"name": "add_135", "class_name": "Add", "config": {"name": "add_135", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_91", 0, 0, {}], ["conv2d_243", 0, 0, {}]]]}, {"name": "conv2d_246", "class_name": "Conv2D", "config": {"name": "conv2d_246", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999969612645e-09}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_135", 0, 0, {}]]]}, {"name": "average_pooling2d_100", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_100", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_135", 0, 0, {}]]]}, {"name": "activation_92", "class_name": "Activation", "config": {"name": "activation_92", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["conv2d_246", 0, 0, {}]]]}, {"name": "conv2d_245", "class_name": "Conv2D", "config": {"name": "conv2d_245", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_100", 0, 0, {}]]]}, {"name": "add_136", "class_name": "Add", "config": {"name": "add_136", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_92", 0, 0, {}], ["conv2d_245", 0, 0, {}]]]}, {"name": "conv2d_248", "class_name": "Conv2D", "config": {"name": "conv2d_248", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999969612645e-09}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_136", 0, 0, {}]]]}, {"name": "average_pooling2d_101", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_101", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_136", 0, 0, {}]]]}, {"name": "activation_93", "class_name": "Activation", "config": {"name": "activation_93", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["conv2d_248", 0, 0, {}]]]}, {"name": "conv2d_247", "class_name": "Conv2D", "config": {"name": "conv2d_247", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_101", 0, 0, {}]]]}, {"name": "add_137", "class_name": "Add", "config": {"name": "add_137", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_93", 0, 0, {}], ["conv2d_247", 0, 0, {}]]]}, {"name": "conv2d_250", "class_name": "Conv2D", "config": {"name": "conv2d_250", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999969612645e-09}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_137", 0, 0, {}]]]}, {"name": "average_pooling2d_102", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_102", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_137", 0, 0, {}]]]}, {"name": "activation_94", "class_name": "Activation", "config": {"name": "activation_94", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["conv2d_250", 0, 0, {}]]]}, {"name": "conv2d_249", "class_name": "Conv2D", "config": {"name": "conv2d_249", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_102", 0, 0, {}]]]}, {"name": "add_138", "class_name": "Add", "config": {"name": "add_138", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_94", 0, 0, {}], ["conv2d_249", 0, 0, {}]]]}, {"name": "conv2d_252", "class_name": "Conv2D", "config": {"name": "conv2d_252", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 4.999999969612645e-09}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_138", 0, 0, {}]]]}, {"name": "average_pooling2d_103", "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_103", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["add_138", 0, 0, {}]]]}, {"name": "activation_95", "class_name": "Activation", "config": {"name": "activation_95", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["conv2d_252", 0, 0, {}]]]}, {"name": "conv2d_251", "class_name": "Conv2D", "config": {"name": "conv2d_251", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_pooling2d_103", 0, 0, {}]]]}, {"name": "add_139", "class_name": "Add", "config": {"name": "add_139", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["activation_95", 0, 0, {}], ["conv2d_251", 0, 0, {}]]]}, {"name": "global_average_pooling2d_17", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_17", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["add_139", 0, 0, {}]]]}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 48, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 2.499999993688107e-07}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_average_pooling2d_17", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 8192, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 2.499999993688107e-07}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_14", 0, 0, {}]]]}], "input_layers": [["input_18", 0, 0]], "output_layers": [["dense_15", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_241/kernel", "shape": [1, 1, 1, 16], "dtype": "float32"}, {"name": "conv2d_242/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "conv2d_243/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "conv2d_244/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv2d_245/kernel", "shape": [1, 1, 32, 48], "dtype": "float32"}, {"name": "conv2d_246/kernel", "shape": [3, 3, 32, 48], "dtype": "float32"}, {"name": "conv2d_247/kernel", "shape": [1, 1, 48, 64], "dtype": "float32"}, {"name": "conv2d_248/kernel", "shape": [3, 3, 48, 64], "dtype": "float32"}, {"name": "conv2d_249/kernel", "shape": [1, 1, 64, 96], "dtype": "float32"}, {"name": "conv2d_250/kernel", "shape": [3, 3, 64, 96], "dtype": "float32"}, {"name": "conv2d_251/kernel", "shape": [1, 1, 96, 192], "dtype": "float32"}, {"name": "conv2d_252/kernel", "shape": [3, 3, 96, 192], "dtype": "float32"}, {"name": "dense_14/kernel", "shape": [192, 48], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [48], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [48, 8192], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [8192], "dtype": "float32"}]}]}